# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' 
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' 
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn' # Needed to install fonts
brew 'pgcli'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'

# Development
brew 'imagemagick'
brew 'yarn'
brew 'node'
brew 'tmux'
brew 'nvim'
brew 'lazygit'

# Apps
cask '1password'
cask '1password-cli'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'pastebot'
cask 'screen-studio'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'ghostty'
cask 'superwhisper'
cask 'raycast'
cask 'alacritty'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-3270-nerd-font'

