# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' 
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' 
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'
brew 'node'

# Apps
cask '1password'
brew '1password-cli'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'pastebot'
cask 'screen-studio'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'pycharm'
cask 'ghostty'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'MyWoosh', id: 1498889644
mas 'Numbers', id: 409203825
mas 'Spring', id: 1508706541
mas 'Things', id: 904280696